{"data":[{"Id":"1","Framework":"jQuery","Category":"Generic DOM & CSS","Description":" \njQuery is a fast, small, and feature-rich JavaScript library designed to simplify the client-side scripting of HTML. \n  \nIt is the most popular library used over 80% of the 10,000 most websites.\n\nStrong developer community support and large plugin repositories","SOC":"No","POV":" \nLibrary for Dom manipulations\n-Support for event handling, Ajax, Deffered/Promise Support\nExcellent cross browser Support for Dom access\nNo structural/framework opinion for seperation of concern","Adoptability":"High","Usage":"More than 10","Focus_Radar":"Ubiquitous","Required":"Table Stakes","Learning_Curve":"Low","link":"http://www.jquery.com","cov":80,"ate":85},{"Id":"2","Framework":"DOJO","Category":"Generic DOM & CSS","Description":" \nThe dojo package covers a wide range of functionality like AJAX, DOM manipulation, class-type programming, events, promises, data stores, drag-and-drop and internationalization libraries.\nit provides build tools for optimizing JavaScript and CSS, generating documentation, and unit testing; it supports packaging, internationalization, localization, and accessibility; and it provides a rich suite of commonly needed utility classes and user-interface widgets.","SOC":"Yes","POV":" \nLibrary for Dom manipulations\nModularity and AMD Loading \nAspects and 'FunctiontoFunctionEvents' \nDeferreds and Unified AJAX Transports \nDijit UI Framework \nWebSocket and long-polling wrappers \nDojo Objective Harness Testing Framework","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"Medium","link":"http://dojotoolkit.org/","cov":8,"ate":10},{"Id":"3","Framework":"EXT JS","Category":"Generic DOM & CSS","Description":" \nExt JS is a JavaScript application framework for building interactive web applications using Ajax, DHTML and DOM scripting\nIt's ideal for complex web application interface with great controls for windows, tables, etc. \nSteep Learning_Curve and a paid liscense ","SOC":"Yes","POV":" \nLibrary for Dom manipulations\nCross Platform Browser Compatibility \nComponent & Template-based binding framework \nRapid Prototyping \nMulti-platform / No plugins \nBased on Object Orientated","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://www.sencha.com/products/extjs/","cov":5,"ate":5},{"Id":"4","Framework":"Bootstrap","Category":"Generic DOM & CSS","Description":" \nBootstrap is a  Sleek, intuitive, and powerful front-end framework for building faster and easier responsive layouts.\nBoottstrap is a collection of tools for creating websites and web applications. It contains HTML and CSS-based grid layouts, design templates for typography, forms, buttons, navigation and other interface components, as well as optional JavaScript extensions. \nBoottstrap is web-based Customizer / CSS pre-processor support to create your own css style guide. ","SOC":"No","POV":" \nEasy to get started\nGreat grid system \nBase styling for most HTML elements \nExtensive list of components \nBundled Javascript plugins \nFuture Compatibility & Responsiveness","Adoptability":"High","Usage":"More than 10","Focus_Radar":"Strengthen","Required":"Table Stakes","Learning_Curve":"Low","link":"http://getbootstrap.com/","cov":5,"ate":55},{"Id":"5","Framework":"SASS","Category":"Generic DOM & CSS","Description":" \nSass is a scripting language that is interpreted into Cascading Style Sheets (CSS).\nFaster development, avoid repetative CSS coding, CSS optimization and Reusability \nSASS supports nesting, varibles, mixins and generating cross browser compaitable CSS","SOC":"No","POV":" \nFewer HTTP Requests by Using the @import Attribute\nKeep Your Responsive Design Project More Organized  and Modularized \n@extend reduces redundant rules \nReusable Color Scheming \nA Responsive HTML5 SASS-Based Framework \nDon't Repeat Similar CSS Statements Throughout Your Project","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Incubate","Required":"Table Stakes","Learning_Curve":"Low","link":"http://sass-lang.com/","cov":90,"ate":10},{"Id":"6","Framework":"RequireJS","Category":"Generic DOM & CSS","Description":" \nRequireJS loads plain JavaScript files as well as more defined modules. It is optimized for in-browser use, including in a Web Worker, but it can be used in other JavaScript environments, like Rhino and Node. It implements the Asynchronous Module API.","SOC":"No","POV":" \nExplicit Dependency Specifications\nExplicit Export Specifications \nAvoiding Script Tag Soup \nConfidence in Refactoring \nShines a Light on Circular Dependencies and Intent \nOnly load what you need, on demand and asynchronously \nConsistent approach to mocking modules if testing via stubbing","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Incubate","Required":"Table Stakes","Learning_Curve":"Low","link":"http://requirejs.org/","cov":75,"ate":10},{"Id":"7","Framework":"LESS","Category":"Generic DOM & CSS","Description":" \nLESS supports both client side and server side compiling\n\nLESS supports nesting, varibles, mixins and generating cross browser compaitable.","SOC":"No","POV":" \nKeep Your Responsive Design Project More Organized  and Modularized\nCleaner Structure With Nesting \nMixins with Arguments / Dynamic Mixins \nReusing Whole Classes \nNamespaces and Accessors","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Incubate","Required":"Table Stakes","Learning_Curve":"Low","link":"http://lesscss.org/","cov":70,"ate":13},{"Id":"8","Framework":"Backbone","Category":"MV*","Description":" \nBackbone supplies structure to JavaScript-heavy applications by providing models key-value binding and custom events, collections with a rich API of enumerable functions, views with declarative event handling, and connects it all to your existing application over a RESTful JSON interface.\nBackbone is known for being lightweight, as its only dependency is on one JavaScript library Underscore.js \nHuge developer community support","SOC":"Yes","POV":" \nJavaScript library with a RESTful JSON interface\nBased on the model-view-presenter (MVP) application design paradigm \nBased on Single Responsibility Principle \nMaintainability, Compatibility, Reusability and Testability","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Strengthen","Required":"Specializtion","Learning_Curve":"High","link":"http://backbonejs.org/","cov":8,"ate":63},{"Id":"9","Framework":"Angular","Category":"MV*","Description":" \nAngular is a mvc framework for the web with no additional templating engine/language required.\nReusable HTML components  \ndirectives, two way data binding between view & code, routing, deep linking, history, unit testing framework built in. ,angular mvc patters, model is fetched and manipulated by controller, model gets rendered to users as the view. \nIt automatically synchronizes data from your UI (view) with your JavaScript objects (model) through 2-way data binding.","SOC":"Yes","POV":" \nBased on Model -View \nWhatever (MVW) design pattern,  capability with model-view-controller (MVC)\nGives XAML Developers a Place to Go on the Web \nGets Rid of Ritual and Ceremony \nHandles Dependencies \nAllows Developers to Express UI Declaratively and Reduce Side Effects \nEmbraces Test-Driven Development, Behavior-Driven Development \nSupports Single Page Applications \nEnables a Design <—> Development Workflow \nTwo way data binding, Templates, Form Validations and Deep Linking for dynamic pages","Adoptability":"High","Usage":"Less than 5","Focus_Radar":"Strengthen","Required":"Specializtion","Learning_Curve":"High","link":"https://angularjs.org/","cov":25,"ate":58},{"Id":"10","Framework":"Stapes","Category":"MV*","Description":" \nLight weight MVC framework compatible with other frameworks\nClass creation, custom events, and data methods.","SOC":"","POV":" \nMicro JavaScript library for writing MVC applications\nFlexible, Simple and light \nBased around events and inheritance \nWorks nicely with RequireJS, jQuery, and Zepto","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"Medium","link":"http://hay.github.io/stapes/","cov":18,"ate":7},{"Id":"11","Framework":"Ember","Category":"MV*","Description":" \nEmber is a mvc framework that supports bindings, computed properties and auto updation of templates.\nEmber is optimal for single page application \nEmber supports a data persistence library that maps client-side models to server-side data \nEmber is easily configurable using adapters that can work with almost any kind of server","SOC":"","POV":" \nBased on the model-view-controller (MVC) software architectural pattern\nCreate scalable single-page applications by incorporating common idioms \nBest practices into a framework that provides a rich object model \nDeclarative two-way data binding, computed properties, automatically updating templates","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://emberjs.com/","cov":55,"ate":15},{"Id":"12","Framework":"Knockout","Category":"MV*","Description":" \nKnockout is a JavaScript MVVM (a modern variant of MVC) library that makes it easier to create rich, desktop-like user interfaces with JavaScript and HTML. \nIt uses observers to make your UI automatically stay in sync with an underlying data model, along with a powerful and extensible set of declarative bindings to enable productive development. \nBuilt-in templating engine","SOC":"","POV":" \nStandalone JavaScript implementation of the Model-View-ViewModel(MVVM) pattern with templates\nElegant dependency tracking \n automatically updates the right parts of your UI whenever your data model changes \nDeclarative bindings \na simple and obvious way to connect parts of your UI to your data model.  \nYou can construct a complex dynamic UIs easily using arbitrarily nested binding contexts \nTrivially extensible \nimplement custom behaviors as new declarative bindings for easy reuse in just a few lines of code","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://knockoutjs.com/","cov":52,"ate":5},{"Id":"13","Framework":"Handlebars","Category":"Template","Description":"Helps in building semantic templates\nCompatible with Mustache Precompile the templates. This will result in a smaller required runtime library and significant savings from not having to compile the template in the browser. This can be especially important when working with mobile devices.   Supports block expressions, html escaping,  and various utility helper methods   ","SOC":"","POV":" \nHandlebars is one of the most advanced (pre-compiling and the like), feature-rich, and popular of all the JavaScript templating engines, and it has the most active community\nHandlebars is a logic-less templating engine, which means there is little to no logic in your templates that are on the HTML page.  \nThe most important use of Handlebars, and any templating engine, is to keep your HTML pages simple and clean and decoupled from the logic-based JavaScript files, and Handlebars serves this purpose well.","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Strengthen","Required":"Table Stakes","Learning_Curve":"Medium","link":"http://handlebarsjs.com/","cov":20,"ate":70},{"Id":"14","Framework":"Mustache","Category":"Template","Description":"Mustache can be used for HTML and works by expanding tags in a template using values provided in a hash or object.\nIt is a logic less template and has no if else or any conditional statements support.Supports commenting, partials and set delimiters etc.","SOC":"","POV":" \nSimple web template system\nDescribed as a 'logic-less' system because it lacks any explicit control flow statements \nNamed 'Mustache' because of heavy use of curly braces that resemble a mustache \nUsed mainly for mobile and web applications","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Table Stakes","Learning_Curve":"Medium","link":"http://mustache.github.io/","cov":15,"ate":15},{"Id":"15","Framework":"DUST","Category":"Template","Description":"Dust is another templating language like any other templates                                                       Supports asynchronous, streaming, precise and it is safer and faster.                                            Not supported in IE8","SOC":"","POV":" \nSimple web template system\nCompiled to JavaScript for speed of execution \nTemplates can be sent to a browser once and reused which is not the case with server-side generated web pages \nTemplates compiled to JavaScript can be served from a CDN for faster loading","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"Medium","link":"http://akdubya.github.io/dustjs/","cov":22,"ate":3},{"Id":"16","Framework":"Underscore","Category":"Template","Description":" Underscore provides 80-odd functions that support the usual functional suspects: like map, select, invoke.\n It also has more specialized helpers like function binding, javascript templating, deep equality testing, and so on. Powerful templating support.  ","SOC":"","POV":" \nUnderscore is a javascript library for working with data\nMakes it really easy to perform common operations on data \nWorks on javascript JSON objects, arrays, etcetera.  \nContains a wide variety of very useful data related functions for doing all kinds of operations on data \nThe great thing about Underscore is that it cam be used with other libraries","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Strengthen","Required":"Specializtion","Learning_Curve":"Medium","link":"http://underscorejs.org/","cov":5,"ate":80},{"Id":"17","Framework":"DoT","Category":"Template","Description":"Fastest and concise JS templating engine for Node JS and browsers.\nNo dependencies  and extremely fast.Runtime evaluation and interpolation.Supports array Iterators and control whitespace. It is also streaming friendly","SOC":"","POV":" \nno dependencies\nextremely fast \ncustom delimiters \ncomposited \ncontrol whitespace \nstrip or preserve \nworks on any text \nstreaming friendly \nuse it as logic-less or with logic","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"Low","link":"http://olado.github.io/doT/index.html","cov":25,"ate":10},{"Id":"18","Framework":"Jade","Category":"Template","Description":"Jade is designed primarily for server side templating in node.js. It is only intended to produce XML like documents (HTML, RSS etc.)\nJade is whitespace sensitive, so there's no need to close your tags; Jade does that for you.Jade can output raw text from JavaScript variables. Jade will also helpfully filter the text for you so it's safe from nasty HTML injection attacks.","SOC":"","POV":" \nDesigned primarily for server side templating in node.js\nOnly intended to produce XML like documents (HTML, RSS etc.) \nCan be used just as a short hand for HTML","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Strengthen","Required":"Specializtion","Learning_Curve":"Low","link":"http://jade-lang.com/","cov":20,"ate":55},{"Id":"19","Framework":"JQM","Category":"Mobile","Description":"jQuery Mobile is a framework for creating mobile web applications which works on all smartphones and tablets.\nSupports all native mobile events like touch, swipe etc. Provides styles and themes for HTML elements like radio buttons, checkboxes etc.Ability to build mobile apps using HTML5/CSS3 techniques.","SOC":"","POV":" \nWide browser and device coverage\nTouch-friendly form inputs and UI widgets \nResponsive web design ready \nLayout and theming engine \nAjax page navigation model ","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Strengthen","Required":"Table Stakes","Learning_Curve":"Low","link":"http://jquerymobile.com/","cov":28,"ate":63},{"Id":"20","Framework":"ZEPTO","Category":"Mobile","Description":"Zepto is jquery compatibile mobile development JS library.                                                        \nSupports all modern browsers and OS but not less than IE10Zepto is a good choice for browser extensions (for Safari, Chrome and Firefox) and to develop HTML-based views within native app frameworks, such as PhoneGap.   ","SOC":"","POV":" \n minimalist JavaScript library for modern browsers with a largely jQuery-compatible API\nLoad much faster \nstays to lean by not attempting to fix ancient browsers \nWorks with native apps.","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://zeptojs.com/","cov":25,"ate":20},{"Id":"21","Framework":"DOJO MOBILE","Category":"Mobile","Description":"Dojo Mobile is a world class HTML5 mobile JavaScript framework that enables rapid development of mobile web applications with a native look and feel on modern webkit-enabled mobile devices such as iPhone, iPod Touch, iPad, Android and RIM smartphones and tablets.\nDojo includes a new set of components designed from scratch with mobile in mind, including forms and databinding. Switches, Sliders, Lists, Actions etc.Dojo Mobile is now integrated with the new MVC and Application Controller packages.","SOC":"","POV":" \nLightweight, minimal dependencies\nProvides CSS themes for both iOS and Android-based devices \nProvides iOS and Android-style controls and widgets \nProvides a small compat resource for using JavaScript animation  for clients with don't support CSS3 animations \nResponds to both orientations as well orientation changes \nComplete mobile widget framework -\nno need to collect widgets from multiple sources","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://dojotoolkit.org/features/mobile","cov":30,"ate":35},{"Id":"22","Framework":"Phonegap","Category":"Hybrid","Description":"PhoneGap is a free and open source framework that allows you to create mobile apps using standardized web APIs for iOS and Android.\nIt enables developers to build applications for mobile devices using JavaScript, HTML5, and CSS3, instead of device-specific languages such as Objective-C or Java.PhoneGap is a platform that allows you to use mobile devices features, such as GPS, camera, etc., through a JavaScript interface.","SOC":"","POV":" \nOpen source framework\nQuickly building cross-platform mobile apps using HTML5, Javascript and CSS \nResulting applications are hybrid, meaning that they are neither truly native nor purely web-based \nProvides access to underlying hardware such as the accelerometer, camera and GPS \nUsing a foreign function interface to access the native resources of the device","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://phonegap.com/","cov":75,"ate":23},{"Id":"23","Framework":"IBM Worklight","Category":"Hybrid","Description":"IBM Worklight is an open, complete and advanced mobile enterprise application platform for HTML5, hybrid and native mobile applications. It lets developers use JavaScript, HTML5 and CSS3 to develop applications for different mobile devices.","SOC":"","POV":" \nProvides an open, comprehensive and advanced mobile application platform for smartphones and tablets\nHybrid and native applications Leveraging standards-based technologies and tools \nThe platform ships with a comprehensive development environment, mobile-optimized middleware, and an integrated management, and analytics console, supported by a variety of security mechanisms \nImplement runtime skins to build apps that automatically adjust to environment guidelines such as form factor, screen density, HTML support, and UI input method","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://www-03.ibm.com/software/products/en/worklight-foundation","cov":80,"ate":45},{"Id":"24","Framework":"Titanium","Category":"Hybrid","Description":"Titanium is an open-source framework that allows the creation of mobile apps on platforms including iOS, Android, Windows Phone, BlackBerry OS, and Tizen from a single JavaScript codebase. It is a cross-platform API for accessing native UI components such as navigation bars, menus, and dialog boxes and native device functionality including the file system, network, geolocation, accelerometer, and maps.","SOC":"","POV":" \nan open source development platform that allows to create native applications (mobile and desktop) using web technologies\nRapid prototyping \nWeb-oriented :\nEflects an intrinsic characteristic of prototype-based scripting languages that is the combination of flexibility and structure \nA single environment for coding, debugging and publishing apps \nAppcelerator Alloy MVC framework","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://www.appcelerator.com/titanium/titanium-sdk/","cov":53,"ate":45},{"Id":"25","Framework":"Sencha","Category":"Hybrid","Description":"Sencha framework can be used to develop user interfaces for mobile web applications that look and feel like native applications on supported mobile devices. It is fully based on HTML5, CSS3 and JavaScript and enables developers to quickly and easily create HTML5 based mobile apps that work on all devices.","SOC":"","POV":" \n user interface (UI) JavaScript library, or framework, specifically built for the Mobile Web\n fully based on web standards such as HTML5, CSS3 and JavaScript \nproduce a native-app-like experience inside a browser \nincludes a set of graphical user interface GUI-based controls (or components) for use within mobile web applications \nsupports common touch gestures built from touch events, which are Web standards but supported only by Android, iOS, and some touch enabled devices","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://www.sencha.com/","cov":8,"ate":45},{"Id":"26","Framework":"Grunt","Category":"Testing / Build / Workflow","Description":" \nGrunt is a task-based command-line tool that speeds up workflows by reducing the effort required to prepare assets for production.\nGrunt is open sourced and supported by large community of developers. Hundreds of plugins are avilable","SOC":"","POV":" \na fantastic task-based command line tool written in JavaScript on top of the wonderful Node.js platform\nprovides a consistent interface for configuring and using any task \nallows you to aggregate tasks using aliases, this is a very powerful feature which allows you to abstract the details of a more generic task \n has a strong and rapidly growing community \nprovides all the power of Node.js for your tasks.  \nIt also provides some very fundamental and powerful abstractions for common needs, like working with the file system or logging to the standard out (stdout).","Adoptability":"High","Usage":"More than 5","Focus_Radar":"Strengthen","Required":"Table Stakes","Learning_Curve":"Medium","link":"http://gruntjs.com/","cov":35,"ate":85},{"Id":"27","Framework":"Yoeman","Category":"Testing / Build / Workflow","Description":" \nYeoman runs as a command-line interface written in Node.js which combines several functions into one place, such as generating a starter template, managing dependencies, running unit tests, providing a local development server, and optimizing production code for deployment.","SOC":"","POV":" \na robust and opinionated client-side stack\ncomprising tools and frameworks that can help developers quickly build beautiful web applications \nWith a modular architecture that can scale out of the box \nincludes support for linting, testing, minification and much more \nfast, performant and is optimized to work best in modern browsers","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"Medium","link":"http://yeoman.io/","cov":53,"ate":25},{"Id":"28","Framework":"Phanthom","Category":"Testing / Build / Workflow","Description":" \nPhantomJS is a headless WebKit scriptable with a JavaScript API. It has fast and native support for various web standards: DOM handling, CSS selector, JSON, Canvas, and SVG.\nit supports headless website testing, screen catpuring of webpages, page automation and network monitoring","SOC":"","POV":" \na headless WebKit scriptable with a JavaScript API\n fast and native support for various web standards: DOM handling, CSS selector, JSON, Canvas, and SVG \nRun functional tests with frameworks such as Jasmine, QUnit, Mocha, Capybara, WebDriver, and many others \nProgrammatically capture web contents, including SVG and Canvas \nAccess and manipulate webpages with the standard DOM API, or with usual libraries like jQuery \nMonitor page loading and export as standard HAR files","Adoptability":"High","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://phantomjs.org/","cov":60,"ate":38},{"Id":"29","Framework":"Bower","Category":"Testing / Build / Workflow","Description":" \nBower is a package manager that helps to manage third party and external dependencies","SOC":"","POV":" \npackage manager for the web\nunopinionated solution to the problem of front-end package management \nSimplify what might be called declarative dependency management; i.e. you declare your dependencies in bower.json so that other things can determine them easily \nNo need to commit dependencies to version control \nSemantic versioning is used to help define a range of acceptable versions for a dependency, which makes it easy to update to newer versions within the defined range \nNo need to locate various builds (debug, minified, etc) \nSimple to use different builds of a dependency for dev vs. prod","Adoptability":"High","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://bower.io/","cov":90,"ate":38},{"Id":"30","Framework":"KARMA","Category":"Testing / Build / Workflow","Description":" \nKarma is a test runner mainly used for angular projects.  \n-Karma spawns a web server that executes source code against test code for each of the browsers connected. The results for each test against each browser are examined and displayed via the command line to the developer such that they can see which browsers and tests passed or failed.  -Karma also watches all the files, specified within the configuration file, and whenever any file changes, it triggers the test run by sending a signal the testing server to inform all of the captured browsers to run the test code again.  ","SOC":"","POV":" \nTest your code on real browsers and real devices such as phones, tablets or on a headless PhantomJS instance\nControl the whole workflow from the command line or your IDE \njust save a file and Karma will run all the tests \nDescribe your tests with Jasmine, Mocha, QUnit, or write a simple adapter for any framework you like \nDeveloped for and maintained by the open source community at GitHub \nEasy debugging directly from your IDE via WebStorm or Google Chrome \nSimple integration with Jenkins, Travis or Semaphore","Adoptability":"High","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://karma-runner.github.io/0.12/index.html","cov":87,"ate":32},{"Id":"31","Framework":"Jasmine","Category":"Testing / Build / Workflow","Description":" \nJasmine is a Behavior Driven Development testing framework for JavaScript.\nIt does not rely on browsers, DOM, or any JavaScript framework.","SOC":"","POV":" \nopen source testing framework for JavaScript\nbehavior-driven development framework for testing JavaScript code \nhas a clean, obvious syntax so that you can easily write tests","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://jasmine.github.io/","cov":7,"ate":35},{"Id":"32","Framework":"Mocha","Category":"Testing / Build / Workflow","Description":" \nMocha is a feature-rich JavaScript test framework running on node.js and the browse\nMocha allows serial running of unit testing and also provide  API for running tests.","SOC":"","POV":" \nfeature-rich JavaScript test framework running on node.js and the browser\n tests run serially, allowing for flexible and accurate reporting, while mapping uncaught exceptions to the correct test cases \nsimple async support, including promises \noptionally run tests that match a regexp \nauto-detects and disables coloring for non-ttys \njavascript API for running tests \nextensible test DSLs or 'interfaces' \narbitrary transpiler support (coffee-script etc)","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://visionmedia.github.io/mocha/","cov":75,"ate":35},{"Id":"33","Framework":"Qunit","Category":"Testing / Build / Workflow","Description":" \nQUnit is a JavaScript unit testing framework. Mostly used by the jQuery Project for testing jQuery, jQuery UI and jQuery Mobile, it can be used to test any generic JavaScript code. Testing server-side code is possible as well, but QUnit's features are focused on the challenges of testing code in the web browser.","SOC":"","POV":" \npowerful, easy-to-use JavaScript unit testing framework\nDifferent browsers behave differently \nCaffiene & intuition only carry you so far \nwrite a test that asserts a bug's existence.","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://qunitjs.com/","cov":3,"ate":23},{"Id":"34","Framework":"Chai","Category":"Testing / Build / Workflow","Description":" \nChai Framework is a BDD / TDD assertion framework for node.js and the browser that can be paired with any testing framework.","SOC":"","POV":" \nChai is a BDD / TDD assertion library for node\nseveral interfaces that allow the developer to choose the most comfortable \nchain-capable BDD styles provide an expressive language & readable style \nTDD assert style provides a more classical feel \nPlugins extend Chai's assertions to new contexts such as vendor integration & object construction","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://chaijs.com/","cov":85,"ate":15},{"Id":"35","Framework":"Selenium","Category":"Testing / Build / Workflow","Description":" \nSelenium is a portable software testing framework for web applications. Selenium provides a record/playback tool for authoring tests without learning a test scripting language (Selenium IDE). ","SOC":"","POV":"","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://docs.seleniumhq.org/","cov":55,"ate":31},{"Id":"36","Framework":"Raphael","Category":"Visulaization","Description":" \nData visualization library that supports IE8+. Primary rendering technology is SVG (Scalable Vector Graphics ) with VML ( Vector Markup language ) fallback.","SOC":"","POV":" \nsmall JavaScript library that should simplify your work with vector graphics on the web\nuses the SVG W3C Recommendation and VML as a base for creating graphics \nProvide an adapter that will make drawing vector art compatible cross-browser and easy","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://raphaeljs.com/","cov":85,"ate":27},{"Id":"37","Framework":"D3","Category":"Visulaization","Description":" \nData Driven Documents ,a data visualization library compatible browsers with SVG support. D3 has an array of in-built layout configurations to help with most of the interactive visulization requirements.","SOC":"","POV":" \nJavaScript library for manipulating documents based on data\nhelps you bring data to life using HTML, SVG and CSS \nemphasis on web standards gives you the full capabilities of modern browsers without tying yourself to a proprietary framework  \ncombining powerful visualization components and a data-driven approach to DOM manipulation \nnot a monolithic framework that seeks to provide every conceivable feature \nsolves the crux of the problem: efficient manipulation of documents based on data \navoids proprietary representation and affords extraordinary flexibility, exposing the full capabilities of web standards such as CSS3, HTML5 and SVG","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://d3js.org/","cov":70,"ate":47},{"Id":"38","Framework":"Highcharts","Category":"Visulaization","Description":" \nHighcharts is a charting library written in pure HTML5/JavaScript. Highcharts supports line, spline, area, areaspline, column, bar, pie, scatter, angular gauges, arearange, areasplinerange, columnrange, bubble, box plot, error bars, funnel, waterfall and polar chart types.","SOC":"","POV":" \nworks in all modern browsers including the iPhone/iPad\nnative browser technologies  \nsupports line, spline, area, areaspline, column, scatter, OHLC, candlestick, flags, arearange, areasplinerange and columnrange chart types \nSimple configuration syntax \nprovides a range selector where the user can zoom in on preselected time ranges like 1m, 1y or YTD, or manually add date ranges \nexporting module enabled, your users can export the chart to PNG, JPG, PDF or SVG format at the click of a button, or print the chart directly from the web page ","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://www.highcharts.com/","cov":68,"ate":3},{"Id":"39","Framework":"Node JS","Category":"Serverside ","Description":"Node.js is a platform built on Chrome's JavaScript runtime V8 \nGoogle's open source JavaScript engine. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.","SOC":"","POV":" \nWeb development in a dynamic language (JavaScript) on a VM that is incredibly fast (V8). It is much faster than Ruby, Python, or Perl\nAbility to handle thousands of concurrent connections with minimal overhead on a single process \ncommand-line tool that can be run as a regular web server and lets one run JavaScript programs \n very good when you need to do several things at the same time \nevent-based so all the wonderful Ajax-like stuff can be done on the server side \nThe event-driven system is fast, compared to traditional Java or ROR frameworks, when handling lots of requests at once","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Strengthen","Required":"Specializtion","Learning_Curve":"High","link":"http://nodejs.org/","cov":15,"ate":95},{"Id":"40","Framework":"Express","Category":"Serverside ","Description":"Express is a minimal and flexible node.js web application framework, providing a robust set of features for building single and multi-page, and hybrid web applications.","SOC":"","POV":" \nminimal and flexible node.js web application framework\nproviding a robust set of features for building single and multi-page, and hybrid web applications \ncreating a robust user-friendly API is quick and easy \nprovides a thin layer of features fundamental to any web application, without obscuring features","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://expressjs.com/","cov":57,"ate":10},{"Id":"41","Framework":"Socket.IO","Category":"Serverside ","Description":"Socket.IO is a event driven JavaScript library for realtime web applications. It has two parts: a client-side library that runs in the browser, and a server-side library for node.js. ","SOC":"","POV":" \nmake realtime apps possible in every browser and mobile device\nblurring the differences between the different transport mechanisms \nprimarily uses the WebSocket protocol \nused as simply a wrapper for WebSocket \n provides many more features \n including broadcasting to multiple sockets \nstoring data associated with each client, and asynchronous I/O","Adoptability":"Medium","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://socket.io/","cov":65,"ate":18},{"Id":"42","Framework":"Babylon.js","Category":"Web GL","Description":"Babylon.js is a complete JavaScript framework for building 3D games with HTML 5 and WebGL. It Supports features like Diffuse, Specular, Emissive, Opacity /, Alpha, Reflection, Ambient, Bump, Up to 4 simultaneous lights etc,.","SOC":"","POV":" \ncomplete JavaScript framework for building 3D games with HTML 5 and WebGL\nComplete scene graph with lights, cameras, materials, sprites, layers and meshes \nComplete collisions/responses system \nUsing the physics engine \nCaching the resources in IndexedDB \nUsing the incremental loading system","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://www.babylonjs.com/","cov":81,"ate":19},{"Id":"43","Framework":"Three.js","Category":"Web GL","Description":"Three.js is a Javascript Web GL framework. It takes advantage of web based renderers for creating GPU enhanced 3D graphics and animations. As such, this framework employs a very broad approach to web graphics without focusing on any single animation niche.","SOC":"","POV":" \n lightweight cross-browser JavaScript library/API used to create and display animated 3D computer graphics on a Web browser\\nallows the creation of GPU-accelerated 3D animations using the JavaScript language as part of a website without relying on proprietary browser plugins","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Incubate","Required":"Specializtion","Learning_Curve":"High","link":"http://threejs.org/","cov":68,"ate":42},{"Id":"44","Framework":"YUI","Category":"Depreciated / Deprecated","Description":"","SOC":"","POV":"","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://yuilibrary.com/","cov":38,"ate":42},{"Id":"45","Framework":"Prototype.JS","Category":"Depreciated / Deprecated","Description":"","SOC":"","POV":"","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://prototypejs.org/","cov":25,"ate":47},{"Id":"46","Framework":"MooTools","Category":"Depreciated / Deprecated","Description":"","SOC":"No","POV":"","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"High","link":"http://mootools.net/","cov":33,"ate":7},{"Id":"47","Framework":"Skrollr","Category":"Parallax / Dom","Description":"Stand-alone parallax scrolling library for mobile (Android + iOS) and desktop. No jQuery. Just plain JavaScript ","SOC":"","POV":" \nStand-alone parallax scrollingallows you to animate any CSS property of any element depending on the horizontal scrollbar position \nneed to do is define key frames for each element at certain points in top scroll offset \nexperimental AMD support","Adoptability":"Low","Usage":"Less than 5","Focus_Radar":"Deemphasize","Required":"Specializtion","Learning_Curve":"Low","link":"https://github.com/Prinzhorn/skrollr","cov":38,"ate":17}]}